      ******************************************************************
      * Nom du Projet   : Calcul de la factorielle
      * Description     : Deux méthode, avec une boucle ou par récurence
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 05_calcul-de-la-fact.

       data division.
       working-storage section.

       procedure division.
           goback.

