      ******************************************************************
      * Nom du Projet   : Recherche du plus grand nombre
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 07_recherche-du-plus.

       data division.
       working-storage section.

       procedure division.
           goback.

