      ******************************************************************
      * Nom du Projet   : Tri à bulles
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 08_tri-a-bulles.

       data division.
       working-storage section.

       procedure division.
           goback.

