      ******************************************************************
      * Nom du Projet   : Calcul du nombre de voyelles
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 09_calcul-du-nombre.

       data division.
       working-storage section.

       procedure division.
           goback.

