      ******************************************************************
      * Nom du Projet   : Vérification de palindrome
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 10_verification-de-p.

       data division.
       working-storage section.

       procedure division.
           goback.

