      ******************************************************************
      * Nom du Projet   : Conversion numérique en mots
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 11_conversion-numeri.

       data division.
       working-storage section.

       procedure division.
           goback.

