      ******************************************************************
      * Nom du Projet   : Calcul de la moyenne
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 12_calcul-de-la-moye.

       data division.
       working-storage section.

       procedure division.
           goback.

