      ******************************************************************
      * Nom du Projet   : Recherche dichotomique
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 13_recherche-dichoto.

       data division.
       working-storage section.

       procedure division.
           goback.

