      ******************************************************************
      * Nom du Projet   : Calcul des nombres premiers
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 14_calcul-des-nombre.

       data division.
       working-storage section.

       procedure division.
           goback.

