      ******************************************************************
      * Nom du Projet   : Simulation d'une file d'attente
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 15_simulation-dune-f.

       data division.
       working-storage section.

       procedure division.
           goback.

