      ******************************************************************
      * Nom du Projet   : Calcul de la suite de Fibonacci
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 16_calcul-de-la-suit.

       data division.
       working-storage section.

       procedure division.
           goback.

