      ******************************************************************
      * Nom du Projet   : Conversion de bases numériques
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 17_conversion-de-bas.

       data division.
       working-storage section.

       procedure division.
           goback.

