      ******************************************************************
      * Nom du Projet   : Gestion d'un carnet d'adresses
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 18_gestion-dun-carne.

       data division.
       working-storage section.

       procedure division.
           goback.

