      ******************************************************************
      * Nom du Projet   : Analyse de texte
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 19_analyse-de-texte.

       data division.
       working-storage section.

       procedure division.
           goback.

