      ******************************************************************
      * Nom du Projet   : Calcul de l'écart-type
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 20_calcul-de-lecart.

       data division.
       working-storage section.

       procedure division.
           goback.

