      ******************************************************************
      * Nom du Projet   : Gestion des stocks
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 21_gestion-des-stock.

       data division.
       working-storage section.

       procedure division.
           goback.

