      ******************************************************************
      * Nom du Projet   : Calculatrice basique
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 22_calculatrice-basi.

       data division.
       working-storage section.

       procedure division.
           goback.

