      ******************************************************************
      * Nom du Projet   : Gestion des étudiants
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 23_gestion-des-etudi.

       data division.
       working-storage section.

       procedure division.
           goback.

