      ******************************************************************
      * Nom du Projet   : Système de paie
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 24_systeme-de-paie.

       data division.
       working-storage section.

       procedure division.
           goback.

