      ******************************************************************
      * Nom du Projet   : Gestion des prêts de bibliothèque
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 25_gestion-des-prets.

       data division.
       working-storage section.

       procedure division.
           goback.

