      ******************************************************************
      * Nom du Projet   : Analyse des ventes
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 26_analyse-des-vente.

       data division.
       working-storage section.

       procedure division.
           goback.

