      ******************************************************************
      * Nom du Projet   : Planification des rendez-vous
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 27_planification-des.

       data division.
       working-storage section.

       procedure division.
           goback.

