      ******************************************************************
      * Nom du Projet   : Jeu du nombre mystère
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 28_jeu-du-nombre-mys.

       data division.
       working-storage section.

       procedure division.
           goback.

