      ******************************************************************
      * Nom du Projet   : Système bancaire simplifié
      * Description     : 
      *
      * Date de création: 13/12/2024
      * Auteur          : Champémont Mathurin
      ******************************************************************
       identification division.
       program-id. 30_systeme-bancaire.

       data division.
       working-storage section.

       procedure division.
           goback.

